zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/acc.h
/* -------- ACC_IMR : (ACC Offset: 0x2c) (R/ 32) Interrupt Mask Register -------- */

typedef union
{
  struct
  {
    uint32_t CE:1;                      /**< bit:      0  Comparison Edge                               */
    uint32_t :31;                       /**< bit:  1..31  Reserved                                      */
  };
  uint32_t w;
} __ACC_IMR_bits_t;

#define ACC_IMR_CE_Pos                        (0)                                            /**< (ACC_IMR) Comparison Edge Position */
#define ACC_IMR_CE_Msk                        (0x1U << ACC_IMR_CE_Pos)                       /**< (ACC_IMR) Comparison Edge Mask */
#define ACC_IMR_Msk                           (0x00000001UL)                                 /**< (ACC_IMR) Register Mask  */

/* -------- ACC_ISR : (ACC Offset: 0x30) (R/ 32) Interrupt Status Register -------- */

typedef union
{
  struct
  {
    uint32_t CE:1;                      /**< bit:      0  Comparison Edge (cleared on read)             */
    uint32_t SCO:1;                     /**< bit:      1  Synchronized Comparator Output                */
    uint32_t :29;                       /**< bit:  2..30  Reserved                                      */
    uint32_t MASK:1;                    /**< bit:     31  Flag Mask                                     */
  };
  uint32_t w;
} __ACC_ISR_bits_t;

#define ACC_ISR_CE_Pos                        (0)                                            /**< (ACC_ISR) Comparison Edge (cleared on read) Position */
#define ACC_ISR_CE_Msk                        (0x1U << ACC_ISR_CE_Pos)                       /**< (ACC_ISR) Comparison Edge (cleared on read) Mask */
#define ACC_ISR_SCO_Pos                       (1)                                            /**< (ACC_ISR) Synchronized Comparator Output Position */
#define ACC_ISR_SCO_Msk                       (0x1U << ACC_ISR_SCO_Pos)                      /**< (ACC_ISR) Synchronized Comparator Output Mask */
#define ACC_ISR_MASK_Pos                      (31)                                           /**< (ACC_ISR) Flag Mask Position */
#define ACC_ISR_MASK_Msk                      (0x1U << ACC_ISR_MASK_Pos)                     /**< (ACC_ISR) Flag Mask Mask */
#define ACC_ISR_Msk                           (0x80000003UL)                                 /**< (ACC_ISR) Register Mask  */

/* -------- ACC_ACR : (ACC Offset: 0x94) (R/W 32) Analog Control Register -------- */

typedef union
{
  struct
  {
    uint32_t ISEL:1;                    /**< bit:      0  Current Selection                             */
    uint32_t HYST:2;                    /**< bit:   1..2  Hysteresis Selection                          */
    uint32_t :29;                       /**< bit:  3..31  Reserved                                      */
  };
  uint32_t w;
} __ACC_ACR_bits_t;

#define ACC_ACR_ISEL_Pos                      (0)                                            /**< (ACC_ACR) Current Selection Position */
#define ACC_ACR_ISEL_Msk                      (0x1U << ACC_ACR_ISEL_Pos)                     /**< (ACC_ACR) Current Selection Mask */
#define   ACC_ACR_ISEL_LOPW_Val               (0x0U)                                         /**< (ACC_ACR) Low-power option.  */
#define   ACC_ACR_ISEL_HISP_Val               (0x1U)                                         /**< (ACC_ACR) High-speed option.  */
#define ACC_ACR_ISEL_LOPW                     (ACC_ACR_ISEL_LOPW_Val << ACC_ACR_ISEL_Pos)    /**< (ACC_ACR) Low-power option. Position  */
#define ACC_ACR_ISEL_HISP                     (ACC_ACR_ISEL_HISP_Val << ACC_ACR_ISEL_Pos)    /**< (ACC_ACR) High-speed option. Position  */
#define ACC_ACR_HYST_Pos                      (1)                                            /**< (ACC_ACR) Hysteresis Selection Position */
#define ACC_ACR_HYST_Msk                      (0x3U << ACC_ACR_HYST_Pos)                     /**< (ACC_ACR) Hysteresis Selection Mask */
#define ACC_ACR_HYST(value)                   (ACC_ACR_HYST_Msk & ((value) << ACC_ACR_HYST_Pos))
#define ACC_ACR_Msk                           (0x00000007UL)                                 /**< (ACC_ACR) Register Mask  */

/* -------- ACC_WPMR : (ACC Offset: 0xe4) (R/W 32) Write Protection Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t WPEN:1;                    /**< bit:      0  Write Protection Enable                       */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t WPKEY:24;                  /**< bit:  8..31  Write Protection Key                          */
  };
  uint32_t w;
} __ACC_WPMR_bits_t;

#define ACC_WPMR_WPEN_Pos                     (0)                                            /**< (ACC_WPMR) Write Protection Enable Position */
#define ACC_WPMR_WPEN_Msk                     (0x1U << ACC_WPMR_WPEN_Pos)                    /**< (ACC_WPMR) Write Protection Enable Mask */
#define ACC_WPMR_WPKEY_Pos                    (8)                                            /**< (ACC_WPMR) Write Protection Key Position */
#define ACC_WPMR_WPKEY_Msk                    (0xFFFFFFU << ACC_WPMR_WPKEY_Pos)              /**< (ACC_WPMR) Write Protection Key Mask */
#define ACC_WPMR_WPKEY(value)                 (ACC_WPMR_WPKEY_Msk & ((value) << ACC_WPMR_WPKEY_Pos))
#define   ACC_WPMR_WPKEY_PASSWD_Val           (0x414343U)                                    /**< (ACC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.  */
#define ACC_WPMR_WPKEY_PASSWD                 (ACC_WPMR_WPKEY_PASSWD_Val << ACC_WPMR_WPKEY_Pos)  /**< (ACC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0. Position  */
#define ACC_WPMR_Msk                          (0xFFFFFF01UL)                                 /**< (ACC_WPMR) Register Mask  */

/* -------- ACC_WPSR : (ACC Offset: 0xe8) (R/ 32) Write Protection Status Register -------- */

typedef union
{
  struct
  {
    uint32_t WPVS:1;                    /**< bit:      0  Write Protection Violation Status             */
    uint32_t :31;                       /**< bit:  1..31  Reserved                                      */
  };
  uint32_t w;
} __ACC_WPSR_bits_t;

