zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/acc.h
#define ACC_WPSR_WPVS_Pos                     (0)                                            /**< (ACC_WPSR) Write Protection Violation Status Position */
#define ACC_WPSR_WPVS_Msk                     (0x1U << ACC_WPSR_WPVS_Pos)                    /**< (ACC_WPSR) Write Protection Violation Status Mask */
#define ACC_WPSR_Msk                          (0x00000001UL)                                 /**< (ACC_WPSR) Register Mask  */

/** \brief ACC register offsets definitions */
#define ACC_CR_OFFSET                (0x00)         /**< (ACC_CR) Control Register Offset */
#define ACC_MR_OFFSET                (0x04)         /**< (ACC_MR) Mode Register Offset */
#define ACC_IER_OFFSET               (0x24)         /**< (ACC_IER) Interrupt Enable Register Offset */
#define ACC_IDR_OFFSET               (0x28)         /**< (ACC_IDR) Interrupt Disable Register Offset */
#define ACC_IMR_OFFSET               (0x2C)         /**< (ACC_IMR) Interrupt Mask Register Offset */
#define ACC_ISR_OFFSET               (0x30)         /**< (ACC_ISR) Interrupt Status Register Offset */
#define ACC_ACR_OFFSET               (0x94)         /**< (ACC_ACR) Analog Control Register Offset */
#define ACC_WPMR_OFFSET              (0xE4)         /**< (ACC_WPMR) Write Protection Mode Register Offset */
#define ACC_WPSR_OFFSET              (0xE8)         /**< (ACC_WPSR) Write Protection Status Register Offset */

/** \brief ACC register API structure */
typedef struct
{
  __O   __ACC_CR_bits_t                ACC_CR;        /**< Offset: 0x00 ( /W  32) Control Register */
  __IO  __ACC_MR_bits_t                ACC_MR;        /**< Offset: 0x04 (R/W  32) Mode Register */
  __I   uint8_t                        Reserved1[0x1C];
  __O   __ACC_IER_bits_t               ACC_IER;       /**< Offset: 0x24 ( /W  32) Interrupt Enable Register */
  __O   __ACC_IDR_bits_t               ACC_IDR;       /**< Offset: 0x28 ( /W  32) Interrupt Disable Register */
  __I   __ACC_IMR_bits_t               ACC_IMR;       /**< Offset: 0x2C (R/   32) Interrupt Mask Register */
  __I   __ACC_ISR_bits_t               ACC_ISR;       /**< Offset: 0x30 (R/   32) Interrupt Status Register */
  __I   uint8_t                        Reserved2[0x60];
  __IO  __ACC_ACR_bits_t               ACC_ACR;       /**< Offset: 0x94 (R/W  32) Analog Control Register */
  __I   uint8_t                        Reserved3[0x4C];
  __IO  __ACC_WPMR_bits_t              ACC_WPMR;      /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I   __ACC_WPSR_bits_t              ACC_WPSR;      /**< Offset: 0xE8 (R/   32) Write Protection Status Register */
} acc_registers_t;
/** @}  end of Analog Comparator Controller */

#endif /* _PIC32CZ_CA70_ACC_COMPONENT_H_ */
